SWAP2015-master/Practicas/Practica4/resultados/ab_bal_haproxy.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.102 (be patient)


Server Software:        Apache/2.4.7
Server Hostname:        192.168.1.102
Server Port:            80

Document Path:          /
Document Length:        38 bytes

Concurrency Level:      5
Time taken for tests:   15.706 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      283000 bytes
HTML transferred:       38000 bytes
Requests per second:    63.67 [#/sec] (mean)
Time per request:       78.532 [ms] (mean)
Time per request:       15.706 [ms] (mean, across all concurrent requests)
Transfer rate:          17.60 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    9   7.1      7      62
Processing:    15   67  26.4     62     228
Waiting:        1   57  23.9     54     227
Total:         25   76  27.2     72     258

Percentage of the requests served within a certain time (ms)
  50%     72
  66%     82
  75%     89
  80%     93
  90%    106
  95%    120
  98%    143
  99%    185
 100%    258 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.102 (be patient)


Server Software:        Apache/2.4.7
Server Hostname:        192.168.1.102
Server Port:            80

Document Path:          /
Document Length:        38 bytes

Concurrency Level:      5
Time taken for tests:   16.931 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      283000 bytes
HTML transferred:       38000 bytes
Requests per second:    59.06 [#/sec] (mean)
Time per request:       84.656 [ms] (mean)
Time per request:       16.931 [ms] (mean, across all concurrent requests)
Transfer rate:          16.32 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1   10   9.0      8      79
Processing:    12   71  31.0     65     211
Waiting:        2   61  29.0     55     205
Total:         23   82  33.5     75     230

Percentage of the requests served within a certain time (ms)
  50%     75
  66%     87
  75%     95
  80%    102
  90%    124
  95%    154
  98%    182
  99%    198
 100%    230 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.102 (be patient)


Server Software:        Apache/2.4.7
Server Hostname:        192.168.1.102
Server Port:            80

Document Path:          /
Document Length:        38 bytes

Concurrency Level:      5
Time taken for tests:   14.173 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      283000 bytes
HTML transferred:       38000 bytes
Requests per second:    70.56 [#/sec] (mean)
Time per request:       70.863 [ms] (mean)
Time per request:       14.173 [ms] (mean, across all concurrent requests)
Transfer rate:          19.50 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    9   6.8      7      46
Processing:    13   59  23.4     56     166
Waiting:        3   50  19.5     47     152
Total:         18   68  24.4     65     190

Percentage of the requests served within a certain time (ms)
  50%     65
  66%     75
  75%     82
  80%     86
  90%    100
  95%    112
  98%    131
  99%    150
 100%    190 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.102 (be patient)


Server Software:        Apache/2.4.7
Server Hostname:        192.168.1.102
Server Port:            80

Document Path:          /
Document Length:        38 bytes

Concurrency Level:      5
Time taken for tests:   14.664 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      283000 bytes
HTML transferred:       38000 bytes
Requests per second:    68.19 [#/sec] (mean)
Time per request:       73.321 [ms] (mean)
Time per request:       14.664 [ms] (mean, across all concurrent requests)
Transfer rate:          18.85 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    9   6.8      7      50
Processing:    12   62  27.7     56     247
Waiting:        1   53  25.0     48     228
Total:         17   71  28.5     65     277

Percentage of the requests served within a certain time (ms)
  50%     65
  66%     76
  75%     83
  80%     88
  90%    102
  95%    122
  98%    145
  99%    177
 100%    277 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.102 (be patient)


Server Software:        Apache/2.4.7
Server Hostname:        192.168.1.102
Server Port:            80

Document Path:          /
Document Length:        38 bytes

Concurrency Level:      5
Time taken for tests:   13.955 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      283000 bytes
HTML transferred:       38000 bytes
Requests per second:    71.66 [#/sec] (mean)
Time per request:       69.774 [ms] (mean)
Time per request:       13.955 [ms] (mean, across all concurrent requests)
Transfer rate:          19.80 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    9   6.4      7      41
Processing:    14   59  21.0     56     158
Waiting:        0   49  18.9     46     144
Total:         19   67  21.7     65     168

Percentage of the requests served within a certain time (ms)
  50%     65
  66%     74
  75%     79
  80%     83
  90%     97
  95%    109
  98%    121
  99%    130
 100%    168 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.102 (be patient)


Server Software:        Apache/2.4.7
Server Hostname:        192.168.1.102
Server Port:            80

Document Path:          /
Document Length:        38 bytes

Concurrency Level:      5
Time taken for tests:   14.271 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      283000 bytes
HTML transferred:       38000 bytes
Requests per second:    70.07 [#/sec] (mean)
Time per request:       71.353 [ms] (mean)
Time per request:       14.271 [ms] (mean, across all concurrent requests)
Transfer rate:          19.37 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    9   6.5      7      48
Processing:    14   60  22.4     56     189
Waiting:        9   50  19.3     48     151
Total:         16   69  23.1     65     192

Percentage of the requests served within a certain time (ms)
  50%     65
  66%     76
  75%     81
  80%     86
  90%     99
  95%    111
  98%    123
  99%    142
 100%    192 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.102 (be patient)


Server Software:        Apache/2.4.7
Server Hostname:        192.168.1.102
Server Port:            80

Document Path:          /
Document Length:        38 bytes

Concurrency Level:      5
Time taken for tests:   14.308 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      283000 bytes
HTML transferred:       38000 bytes
Requests per second:    69.89 [#/sec] (mean)
Time per request:       71.541 [ms] (mean)
Time per request:       14.308 [ms] (mean, across all concurrent requests)
Transfer rate:          19.32 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    9   6.4      7      47
Processing:    13   61  21.3     59     191
Waiting:        0   51  18.5     49     148
Total:         18   69  21.7     67     198

Percentage of the requests served within a certain time (ms)
  50%     67
  66%     76
  75%     82
  80%     86
  90%     97
  95%    108
  98%    121
  99%    134
 100%    198 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.102 (be patient)


Server Software:        Apache/2.4.7
Server Hostname:        192.168.1.102
Server Port:            80

Document Path:          /
Document Length:        38 bytes

Concurrency Level:      5
Time taken for tests:   14.685 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      283000 bytes
HTML transferred:       38000 bytes
Requests per second:    68.10 [#/sec] (mean)
Time per request:       73.425 [ms] (mean)
Time per request:       14.685 [ms] (mean, across all concurrent requests)
Transfer rate:          18.82 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    9   6.9      7      62
Processing:    13   62  22.1     58     167
Waiting:        0   53  20.0     50     146
Total:         19   71  22.9     67     177

Percentage of the requests served within a certain time (ms)
  50%     67
  66%     77
  75%     83
  80%     88
  90%    100
  95%    112
  98%    129
  99%    143
 100%    177 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.102 (be patient)


Server Software:        Apache/2.4.7
Server Hostname:        192.168.1.102
Server Port:            80

Document Path:          /
Document Length:        38 bytes

Concurrency Level:      5
Time taken for tests:   15.521 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      283000 bytes
HTML transferred:       38000 bytes
Requests per second:    64.43 [#/sec] (mean)
Time per request:       77.605 [ms] (mean)
Time per request:       15.521 [ms] (mean, across all concurrent requests)
Transfer rate:          17.81 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    9   7.4      7      63
Processing:    13   66  32.9     60     244
Waiting:        2   56  31.2     50     237
Total:         18   75  35.0     68     266

Percentage of the requests served within a certain time (ms)
  50%     68
  66%     78
  75%     86
  80%     91
  90%    111
  95%    149
  98%    192
  99%    213
 100%    266 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.102 (be patient)


Server Software:        Apache/2.4.7
Server Hostname:        192.168.1.102
Server Port:            80

Document Path:          /
Document Length:        38 bytes

Concurrency Level:      5
Time taken for tests:   14.369 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      283000 bytes
HTML transferred:       38000 bytes
Requests per second:    69.59 [#/sec] (mean)
Time per request:       71.847 [ms] (mean)
Time per request:       14.369 [ms] (mean, across all concurrent requests)
Transfer rate:          19.23 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    9   7.0      7      60
Processing:    13   60  21.1     57     191
Waiting:        0   51  18.1     49     128
Total:         19   69  21.4     66     195

Percentage of the requests served within a certain time (ms)
  50%     66
  66%     75
  75%     81
  80%     87
  90%     97
  95%    107
  98%    119
  99%    135
 100%    195 (longest request)